Conf.Simple/src/DataProcessors/SUI_ОбработкаПотокаШтрихкодов/SUI_ОбработкаПотокаШтрихкодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>SUI_ОбработкаПотокаШтрихкодов</name>
</mdclass:DataProcessor>

Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_barcode_flow/SUI_docs_tbl_barcode_flow.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_barcode_flow</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/DataProcessors/SUI_ОбработкаПотокаШтрихкодов/Forms/СопоставлениеПотокаШтрихкодов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	SUI_docs.sid КАК sid_doc,
		|	SUI_docs.НастройкаДокумента КАК НастройкаДокумента
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК SUI_docs_tbl_barcode_flow
		|		ПО SUI_docs.sid = SUI_docs_tbl_barcode_flow.sid_doc
		|		И НЕ SUI_docs_tbl_barcode_flow.ЭтоШтрихкодКМ
		|		И НЕ SUI_docs_tbl_barcode_flow.ЭтоШтрихкодSSCC
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &id_doc <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.id_doc = &id_doc
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента <> ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументов.ПустаяСсылка)
		|			ТОГДА SUI_docs.НастройкаДокумента = &НастройкаДокумента
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументСсылка")));
	Запрос.УстановитьПараметр("НастройкаДокумента", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "НастройкаДокумента", Справочники.SUI_НастройкиДокументов.ПустаяСсылка(), Тип("СправочникСсылка.SUI_НастройкиДокументов")));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствуют данные потока штрихкодов'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ИнициализироватьТаблицуСопоставления(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ЗагрузитьДанныеДляСопоставления();
	
	Если ЭтотОбъект["ДанныеСопоставления"].Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствуют данные потока штрихкодов'"), , , , Отказ);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСтрокТаблицыДанныеСопоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаписатьПриЗакрытии Тогда
		
		Отказ = Истина;
		
		ОтборСтрок = Новый Структура("Модифицированность,НеобходимоОбработать", Истина, Истина);
		МодифицированныйСтроки = ЭтотОбъект["ДанныеСопоставления"].НайтиСтроки(ОтборСтрок);
		ОтборСтрок.Модифицированность = Ложь;
		НеМодифицированныйСтроки = ЭтотОбъект["ДанныеСопоставления"].НайтиСтроки(ОтборСтрок);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВопросЗаписиПриЗакрытииПродолжить", ЭтотОбъект, 
			Новый Структура("МодифицированныйСтроки, НеМодифицированныйСтроки", МодифицированныйСтроки, НеМодифицированныйСтроки));
		ПоказатьВопрос(ОповещениеОЗавершении, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сохранить изменения?
			|Количество сопоставленных строк: %1
			|Количество не сопоставленных строк: %2'"), МодифицированныйСтроки.Количество(), НеМодифицированныйСтроки.Количество()), 
			РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

&НаКлиенте
Процедура СопоставлениеПриИзменении(Элемент)
	
	Если Элементы["ДанныеСопоставления"].ТекущиеДанные = Неопределено 
			Или Элемент.Имя = "ДанныеСопоставленияМодифицированность" Тогда
		Возврат;
	КонецЕсли;
	
	Элементы["ДанныеСопоставления"].ТекущиеДанные.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если ЭтотОбъект["ДанныеСопоставления"].Количество() > 0 Тогда
		ЗаписатьПриЗакрытии = Истина;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьОписаниеКолонокИзНастройкиКомпоновкиТаблицыОсновногоОбъекта()
	
	ОписаниеКолонок = Новый Соответствие();
	
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек(
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	ПараметрыПолученияНастроек.ОсновнойОбъект = Истина;
	
	Настройки = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	
	Если Настройки.Количество() > 0 Тогда
		
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, Настройки[0].СхемаКомпоновкиДанных,
			Настройки[0].НастройкиКомпоновкиДанных);
			
		НастройкиКомпоновки = Компоновщик.ПолучитьНастройки();
		
		РазрешенныеСимволыИмениПоля = "_"
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры();
		
		Для Каждого ЭлементВыбора Из НастройкиКомпоновки.Выбор.Элементы Цикл
			
			Если ПустаяСтрока(ЭлементВыбора.Заголовок) Тогда
				Продолжить;
			КонецЕсли;
			
			НайденноеПоле = НастройкиКомпоновки.ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбора.Поле);
			
			Если НайденноеПоле = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяПоля = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
				ЭлементВыбора.Заголовок, РазрешенныеСимволыИмениПоля);
			
			Если ПустаяСтрока(ИмяПоля) Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеКолонок.Вставить(ИмяПоля, НайденноеПоле.ТипЗначения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеКолонок);
	
КонецФункции

&НаСервере
Процедура ИнициализироватьТаблицуСопоставления(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОписаниеКолонок = ПолучитьОписаниеКолонокИзНастройкиКомпоновкиТаблицыОсновногоОбъекта();
	
	Если ОписаниеКолонок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Отсутствует настройка основного объекта для таблицы ""%1""'"), 
			Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры), , , , Отказ);
	КонецЕсли;
	
	ДополнительныеНастройки = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	
	АлгоритмСозданияШтрихкодаНоменклатуры = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		"АлгоритмСозданияШтрихкодаНоменклатуры.Алгоритм", "", Тип("Строка"));

	Если ПустаяСтрока(АлгоритмСозданияШтрихкодаНоменклатуры) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствует алгоритм создания штрихкода номенклатуры'"), , , , Отказ);
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИсключаемыеТипыВКолонках = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("Null"));
	
	Реквизиты = Новый Массив;
	
	// Реквизит формы таблица значений: ДанныеСопоставления
	НовыйРеквизит_ДанныеСопоставления = Новый РеквизитФормы("ДанныеСопоставления", Новый ОписаниеТипов("ТаблицаЗначений"));
	Реквизиты.Добавить(НовыйРеквизит_ДанныеСопоставления);
	
	ОписаниеКолонокТаблицы = ОписаниеКолонокТаблицыЗначенийПотокШтрихкодовЭталон();
	
	Для Каждого ОписаниеКолонкиТаблицы Из ОписаниеКолонокТаблицы Цикл
		
		Если ОписаниеКолонкиТаблицы.Тип <> Неопределено Тогда
			ОписаниеТипа = ОписаниеКолонкиТаблицы.Тип;
		ИначеЕсли ОписаниеКолонкиТаблицы.КолонкаРезультата <> Неопределено Тогда
			
			ОписаниеТипаКолонки = ОписаниеКолонок.Получить(ОписаниеКолонкиТаблицы.КолонкаРезультата);
			
			Если ОписаниеТипаКолонки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеТипа = Новый ОписаниеТипов(SUI_ОбщегоНазначенияКлиентСервер.РазностьМассивов(
				ОписаниеТипаКолонки.Типы(), ИсключаемыеТипыВКолонках));
				
		Иначе
			Продолжить;
		КонецЕсли;
		
		Реквизиты.Добавить(Новый РеквизитФормы(ОписаниеКолонкиТаблицы.Имя, ОписаниеТипа, 
			НовыйРеквизит_ДанныеСопоставления.Имя, ОписаниеКолонкиТаблицы.Заголовок));

	КонецЦикла;
	
	ИзменитьРеквизиты(Реквизиты);
	
	// Таблица формы: ДанныеСопоставления
	Элемент_ДанныеСопоставления = Элементы.Добавить(НовыйРеквизит_ДанныеСопоставления.Имя, Тип("ТаблицаФормы"), Элементы.ГруппаТаблицыПотокШтрихкодов);
	
	Элемент_ДанныеСопоставления.ПутьКДанным 				= НовыйРеквизит_ДанныеСопоставления.Имя;
	Элемент_ДанныеСопоставления.ПоложениеКоманднойПанели 	= ПоложениеКоманднойПанелиЭлементаФормы.Авто;
	Элемент_ДанныеСопоставления.ИзменятьСоставСтрок 		= Ложь;
	Элемент_ДанныеСопоставления.ИзменятьПорядокСтрок 		= Ложь;
	Элемент_ДанныеСопоставления.РазрешитьПеретаскивание 	= Ложь;
	
	Для Каждого ОписаниеКолонкиТаблицы Из ОписаниеКолонокТаблицы Цикл
		
		Если ОписаниеКолонкиТаблицы.Тип = Неопределено И 
			ОписаниеКолонкиТаблицы.КолонкаРезультата = Неопределено 
			Или (ОписаниеКолонкиТаблицы.ТаблицаИнтеграции <> Неопределено 
			И Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(ОписаниеКолонкиТаблицы.ТаблицаИнтеграции)) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементКолонкаТаблицы = Элементы.Добавить(Элемент_ДанныеСопоставления.Имя + ОписаниеКолонкиТаблицы.Имя, 
			Тип("ПолеФормы"), Элемент_ДанныеСопоставления);
		ЭлементКолонкаТаблицы.ПутьКДанным = Элемент_ДанныеСопоставления.ПутьКДанным + "." + ОписаниеКолонкиТаблицы.Имя;
		ЭлементКолонкаТаблицы.Заголовок = ОписаниеКолонкиТаблицы.Заголовок;

		Если Не ОписаниеКолонкиТаблицы.ТолькоПросмотр Тогда
			ЭлементКолонкаТаблицы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементКолонкаТаблицы.УстановитьДействие("ПриИзменении", "СопоставлениеПриИзменении");
		КонецЕсли;
		
		Если ОписаниеКолонкиТаблицы.Имя = "Номенклатура" Тогда
			ЭлементКолонкаТаблицы.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
		
		Если ОписаниеКолонкиТаблицы.Имя = "Модифицированность" Тогда
			ЭлементКолонкаТаблицы.Вид = ВидПоляФормы.ПолеФлажка;
		КонецЕсли;
		
		Если ОписаниеКолонкиТаблицы.Имя = "НеобходимоОбработать" Тогда
			ЭлементКолонкаТаблицы.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеКолонокТаблицыЗначенийПотокШтрихкодовЭталон()

	
	
	Описания = Новый Массив();
	
	Описания.Добавить(Новый Структура("Имя, Заголовок, Тип, КолонкаРезультата, ТолькоПросмотр, ТаблицаИнтеграции", 
		"Модифицированность", НСтр("ru = 'Записывать'"), SUI_ОбщегоНазначенияКлиентСервер.ОписаниеТипаБулево(), Неопределено, Ложь));
		
	Описания.Добавить(Новый Структура("Имя, Заголовок, Тип, КолонкаРезультата, ТолькоПросмотр, ТаблицаИнтеграции", 
		"Штрихкод", НСтр("ru = 'Штрихкод'"), SUI_ОбщегоНазначения.ОписаниеТипаСтрока(200), Неопределено, Истина));
		
	Описания.Добавить(Новый Структура("Имя, Заголовок, Тип, КолонкаРезультата, ТолькоПросмотр, ТаблицаИнтеграции", 
		"Номенклатура", НСтр("ru = 'Номенклатура'"), Неопределено, "id_good", Ложь));
		
	Описания.Добавить(Новый Структура("Имя, Заголовок, Тип, КолонкаРезультата, ТолькоПросмотр, ТаблицаИнтеграции", 
		"Характеристика", НСтр("ru = 'Характеристика'"), Неопределено, "id_property", Ложь, Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры));
	
	Описания.Добавить(Новый Структура("Имя, Заголовок, Тип, КолонкаРезультата, ТолькоПросмотр, ТаблицаИнтеграции", 
		"Упаковка", НСтр("ru = 'Упаковка'"), Неопределено, "id_unit", Ложь, Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры));
	
	Описания.Добавить(Новый Структура("Имя, Заголовок, Тип, КолонкаРезультата, ТолькоПросмотр, ТаблицаИнтеграции", 
		"Количество", НСтр("ru = 'Количество'"), SUI_ОбщегоНазначения.ОписаниеТипаЧисло(15, 0, ДопустимыйЗнак.Неотрицательный), , Истина));
	
	Описания.Добавить(Новый Структура("Имя, Заголовок, Тип, КолонкаРезультата, ТолькоПросмотр, ТаблицаИнтеграции", 
		"НеобходимоОбработать", НСтр("ru = 'Необходимо обработать'"), Новый ОписаниеТипов("Булево"), , Истина));
	
	Возврат Описания;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеДляСопоставления()
	
	ПараметрыРезультат = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыРезультат.СхемаКомпоновкиДанных = РегистрыСведений.SUI_docs_tbl_barcode_flow.ПолучитьМакет("ПотокШтрихкодов");
	ПараметрыРезультат.ВозможностьИспользованияВнешнихФункций = Истина;
	ПараметрыРезультат.ВыполнятьВПривилегированномРежиме = Истина;
	
	SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(ПараметрыРезультат.СхемаКомпоновкиДанных, "sid_doc", , sid_doc, , Истина);
	
	ТаблицаПотокШтрихкодов = SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультат);
	
	Для Каждого Колонка Из ТаблицаПотокШтрихкодов.Колонки Цикл
		
		Если СтрНачинаетсяС(Колонка.Имя, "ПользовательскиеПоляПоле") Тогда
			Колонка.Имя = Колонка.Заголовок;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеИзПотокаКопия = ТаблицаПотокШтрихкодов.Скопировать(, "sid,Штрихкод");
	ДанныеИзПотокаКопия.Свернуть("sid,Штрихкод");
	ДанныеИзПотокаКопия.Колонки.Штрихкод.Имя = "barcode";
	ДанныеИзПотока.Загрузить(ДанныеИзПотокаКопия);
	
	ТаблицаПотокШтрихкодов.Свернуть("Штрихкод,Номенклатура,Характеристика,Упаковка,НеобходимоОбработать", "Количество");
	
	ЭтотОбъект["ДанныеСопоставления"].Загрузить(ТаблицаПотокШтрихкодов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаписиПриЗакрытииПродолжить(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ЗаписатьПриЗакрытии = Ложь;
		Закрыть(Ложь);
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		
		Если Не ДополнительныеПараметры.Свойство("ДействияСНеМодифицированнымиСтроками") Тогда
			
			Если ДополнительныеПараметры.НеМодифицированныйСтроки.Количество() > 0 Тогда
			
				КнопкиВопроса = Новый СписокЗначений();
				КнопкиВопроса.Добавить("УдалятьИзПотока", 			НСтр("ru = 'Удалить из потока'"));
				КнопкиВопроса.Добавить("НеУдалятьИзПотока", 		НСтр("ru = 'Не удалять из потока'"));
				КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, 	НСтр("ru = 'Отмена'"));
				
				ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействиеСНесопоставленнымиСтрокамиПослеОтвета", 
					ЭтотОбъект, ДополнительныеПараметры);
				ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Действие с несопоставленными строками:'"), КнопкиВопроса);
				Возврат;
				
			Иначе
				ДополнительныеПараметры.Вставить("ДействияСНеМодифицированнымиСтроками", "НеУдалятьИзПотока");
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПроверитьЗаполнениеМодифицированныхСтрок(ДополнительныеПараметры.МодифицированныйСтроки) Тогда
			Возврат;
		КонецЕсли;
		
		ДлительнаяОперация = ЗаписатьСопоставлениеШтрихкодовНаСервере( 
			(ДополнительныеПараметры.ДействияСНеМодифицированнымиСтроками = "УдалятьИзПотока"));
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		
		ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Сохранение сопоставления штрихкодов'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
		ПараметрыОжидания.ВыводитьСообщения 			= Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаписатьСопоставлениеШтрихкодовЗавершение", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеМодифицированныхСтрок(МодифицированныйСтроки)
	
	ЕстьОшибки = Ложь;
	
	Для Каждого МодифицированнаяСтрока Из МодифицированныйСтроки Цикл
		
		Если Не ЗначениеЗаполнено(МодифицированнаяСтрока.Номенклатура) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для штрихкода %1 не сопоставлена номенклатура'"), МодифицированнаяСтрока.Штрихкод), , , , ЕстьОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаКлиенте
Процедура ДействиеСНесопоставленнымиСтрокамиПослеОтвета(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ДействияСНеМодифицированнымиСтроками", Ответ);
	ДополнительныеПараметры.НеМодифицированныйСтроки.Очистить();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВопросЗаписиПриЗакрытииПродолжить", 
		ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Да);
			
КонецПроцедуры

&НаСервере
Функция ЗаписатьСопоставлениеШтрихкодовНаСервере(УдалятьНеСопоставленные)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТаблицаДанныеСопоставления", ЭтотОбъект["ДанныеСопоставления"].Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ПОМЕСТИТЬ втТаблицаДанныеСопоставления
		|ИЗ
		|	&ТаблицаДанныеСопоставления КАК ТаблицаДанныеСопоставления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	*,
		|	ВЫБОР
		|		КОГДА НЕ втТаблицаДанныеСопоставления.НеобходимоОбработать
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ втТаблицаДанныеСопоставления.Модифицированность
		|	КОНЕЦ КАК Записывать
		|ИЗ
		|	втТаблицаДанныеСопоставления КАК втТаблицаДанныеСопоставления
		|ГДЕ
		|	НЕ втТаблицаДанныеСопоставления.НеобходимоОбработать
		|	ИЛИ втТаблицаДанныеСопоставления.Модифицированность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблицаДанныеСопоставления";
	
	ПараметрыЗаписиСопоставления = Новый Структура();
	ПараметрыЗаписиСопоставления.Вставить("sid_doc", 					sid_doc);
	ПараметрыЗаписиСопоставления.Вставить("НастройкаДокумента", 		НастройкаДокумента);
	ПараметрыЗаписиСопоставления.Вставить("УдалятьНеСопоставленные", 	УдалятьНеСопоставленные);
	ПараметрыЗаписиСопоставления.Вставить("ТаблицаСопоставления", 		Запрос.Выполнить().Выгрузить());
	ПараметрыЗаписиСопоставления.Вставить("ПолученныеЗаписи", 			ДанныеИзПотока.Выгрузить().ВыгрузитьКолонку("sid"));
	ПараметрыЗаписиСопоставления.Вставить("АлгоритмСозданияШтрихкодаНоменклатуры", АлгоритмСозданияШтрихкодаНоменклатуры);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ЗаписатьСопоставлениеПотокаШтрихкодов", 
		ПараметрыЗаписиСопоставления, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьСопоставлениеШтрихкодовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	Иначе
		
		РезультатСопоставления = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаписатьПриЗакрытии = Ложь;
		Закрыть(РезультатСопоставления);
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокТаблицыДанныеСопоставления()
	
	Отбор = Новый Структура();
	Отбор.Вставить("НеобходимоОбработать", Истина);
	
	Элементы["ДанныеСопоставления"].ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

#КонецОбласти
